//
//  DummyResources.swift
//  iRKeyboardExtension
//
//  Created by HFY on 7/10/23.
//  Copyright © 2023 Imran R. All rights reserved.
//

import Foundation

let charNameArray = ["𝔸𝔹ℂ", "𝓐𝓑𝓒", "ＡＢＣ", "𝐀𝐁𝐂", "𝓐𝓑𝓒", "𝔄𝔅ℭ", "ÄḄĊ", "ᗩᗷᑢ", "αв¢", "ɐqɔ", "ᏗᏰፈ", "A̾B̾C̾", "ДБҀ", "ค๒ς", "ልጌር", "A͓̽B͓̽C͓̽", "ⒶⒷⒸ", "A͇B͇C͇", "ᗩᗷᑕ", "A̷B̷C̷"]
//charSetSource
let font1: String = """
𝕢 𝕨 𝕖 𝕣 𝕥 𝕪 𝕦 𝕚 𝕠 𝕡 𝕒 𝕤 𝕕 𝕗 𝕘 𝕙 𝕛 𝕜 𝕝 𝕫 𝕩 𝕔 𝕧 𝕓 𝕟 𝕞 ℚ 𝕎 𝔼 ℝ 𝕋 𝕐 𝕌 𝕀 𝕆 ℙ 𝔸 𝕊 𝔻 𝔽 𝔾 ℍ 𝕁 𝕂 𝕃 ℤ 𝕏 ℂ 𝕍 𝔹 ℕ 𝕄 𝟙 𝟚 𝟛 𝟜 𝟝 𝟞 𝟟 𝟠 𝟡 𝟘 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font2 : String = """
𝓺 𝔀 𝓮 𝓻 𝓽 𝔂 𝓾 𝓲 𝓸 𝓹 𝓪 𝓼 𝓭 𝓯 𝓰 𝓱 𝓳 𝓴 𝓵 𝔃 𝔁 𝓬 𝓿 𝓫 𝓷 𝓶 𝓠 𝓦 𝓔 𝓡 𝓣 𝓨 𝓤 𝓘 𝓞 𝓟 𝓐 𝓢 𝓓 𝓕 𝓖 𝓗 𝓙 𝓚 𝓛 𝓩 𝓧 𝓒 𝓥 𝓑 𝓝 𝓜 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font3 : String = """
ｑ ｗ ｅ ｒ ｔ ｙ ｕ ｉ ｏ ｐ ａ ｓ ｄ ｆ ｇ ｈ ｊ ｋ ｌ ｚ ｘ ｃ ｖ ｂ ｎ ｍ Ｑ Ｗ Ｅ Ｒ Ｔ Ｙ Ｕ Ｉ Ｏ Ｐ Ａ Ｓ Ｄ Ｆ Ｇ Ｈ Ｊ Ｋ Ｌ Ｚ Ｘ Ｃ Ｖ Ｂ Ｎ Ｍ １ ２ ３ ４ ５ ６ ７ ８ ９ ０ － ／ ： ； （ ） ＄ ＆ ＠ “ ． ， ？ ！ ’ ［ ］ ｛ ｝ ＃ ％ ＾ ＊ ＋ ＝ ＿ ＼ ｜ ～ < > € £ ¥ •
"""

let font4 : String = """
𝐪 𝐰 𝐞 𝐫 𝐭 𝐲 𝐮 𝐢 𝐨 𝐩 𝐚 𝐬 𝐝 𝐟 𝐠 𝐡 𝐣 𝐤 𝐥 𝐳 𝐱 𝐜 𝐯 𝐛 𝐧 𝐦 𝐐 𝐖 𝐄 𝐑 𝐓 𝐘 𝐔 𝐈 𝐎 𝐏 𝐀 𝐒 𝐃 𝐅 𝐆 𝐇 𝐉 𝐊 𝐋 𝐙 𝐗 𝐂 𝐕 𝐁 𝐍 𝐌 𝟏 𝟐 𝟑 𝟒 𝟓 𝟔 𝟕 𝟖 𝟗 𝟎 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font5 : String = """
𝓺 𝔀 𝓮 𝓻 𝓽 𝔂 𝓾 𝓲 𝓸 𝓹 𝓪 𝓼 𝓭 𝓯 𝓰 𝓱 𝓳 𝓴 𝓵 𝔃 𝔁 𝓬 𝓿 𝓫 𝓷 𝓶 𝓠 𝓦 𝓔 𝓡 𝓣 𝓨 𝓤 𝓘 𝓞 𝓟 𝓐 𝓢 𝓓 𝓕 𝓖 𝓗 𝓙 𝓚 𝓛 𝓩 𝓧 𝓒 𝓥 𝓑 𝓝 𝓜 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font6 : String = """
𝔮 𝔴 𝔢 𝔯 𝔱 𝔶 𝔲 𝔦 𝔬 𝔭 𝔞 𝔰 𝔡 𝔣 𝔤 𝔥 𝔧 𝔨 𝔩 𝔷 𝔵 𝔠 𝔳 𝔟 𝔫 𝔪 𝔔 𝔚 𝔈 ℜ 𝔗 𝔜 𝔘 ℑ 𝔒 𝔓 𝔄 𝔖 𝔇 𝔉 𝔊 ℌ 𝔍 𝔎 𝔏 ℨ 𝔛 ℭ 𝔙 𝔅 𝔑 𝔐 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font7 : String  = """
q ẅ ë ṛ ẗ ÿ ü ï ö ṗ ä ṡ ḋ ḟ ġ ḧ j ḳ ḷ ż ẍ ċ ṿ ḅ ṅ ṁ Q Ẅ Ё Ṛ Ṫ Ÿ Ü Ї Ö Ṗ Ä Ṡ Ḋ Ḟ Ġ Ḧ J Ḳ Ḷ Ż Ẍ Ċ Ṿ Ḅ Ṅ Ṁ 1 2 ӟ 4 5 6 7 8 9 0 ⸚ / : ; ( ) $ & @ “ ∵ , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font8 : String = """
ᕴ ᘺ ᘿ ᖇ ᖶ ᖻ ᑘ ᓰ ᓍ ᕵ ᗩ S ᕲ ᖴ ᘜ ᕼ ᒚ ᖽᐸ ᒪ ᗱ ᙭ ᑢ ᐺ ᗷ ᘉ ᘻ ᕴ ᘺ ᘿ ᖇ ᖶ ᖻ ᑘ ᓰ ᓍ ᕵ ᗩ S ᕲ ᖴ ᘜ ᕼ ᒚ ᖽᐸ ᒪ ᗱ ᙭ ᑢ ᐺ ᗷ ᘉ ᘻ 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font9 : String = """
q ω є я т у υ ι σ ρ α ѕ ∂ ƒ g н נ к ℓ z χ ¢ ν в η м q ω є я т у υ ι σ ρ α ѕ ∂ ƒ g н נ к ℓ z χ ¢ ν в η м 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font10 : String = """
b ʍ ǝ ɹ ʇ ʎ n ı o d ɐ s p ɟ ƃ ɥ ɾ ʞ ן z x ɔ ʌ q u ɯ b ʍ ǝ ɹ ʇ ʎ n ı o d ɐ s p ɟ ƃ ɥ ɾ ʞ ן z x ɔ ʌ q u ɯ 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ ⅋ @ “ . ‘ ¿ ¡ ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font11 : String = """
Ꭴ Ꮗ Ꮛ Ꮢ Ꮦ Ꭹ Ꮼ Ꭵ Ꭷ Ꭾ Ꮧ Ꮥ Ꮄ Ꭶ Ꮆ Ꮒ Ꮰ Ꮶ Ꮭ ፚ ጀ ፈ Ꮙ Ᏸ Ꮑ Ꮇ Ꭴ Ꮗ Ꮛ Ꮢ Ꮦ Ꭹ Ꮼ Ꭵ Ꭷ Ꭾ Ꮧ Ꮥ Ꮄ Ꭶ Ꮆ Ꮒ Ꮰ Ꮶ Ꮭ ፚ ጀ ፈ Ꮙ Ᏸ Ꮑ Ꮇ 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font12 : String = """
q̾ w̾ e̾ r̾ t̾ y̾ u̾ i̾ o̾ p̾ a̾ s̾ d̾ f̾ g̾ h̾ j̾ k̾ l̾ z̾ x̾ c̾ v̾ b̾ n̾ m̾ Q̾ W̾ E̾ R̾ T̾ Y̾ U̾ I̾ O̾ P̾ A̾ S̾ D̾ F̾ G̾ H̾ J̾ K̾ L̾ Z̾ X̾ C̾ V̾ B̾ N̾ M̾ 1̾ 2̾ 3̾ 4̾ 5̾ 6̾ 7̾ 8̾ 9̾ 0̾ -̾ /̾ :̾ ;̾ (̾ )̾ $̾ &̾ @̾ “̾ .̾ ,̾ ?̾ !̾ ’̾ [̾ ]̾ {̾ }̾ #̾ %̾ ^̾ *̾ +̾ =̾ _̾ \\̾ |̾ ~̾ <̾ >̾ €̾ £̾ ¥̾ •̾
"""

let font13: String = """
q ш э ѓ т Ў ц і о р а ѕ ↁ f Б Ђ ј к l z х с v ъ и м Q Щ Є Я Г Ч Ц І Ф Р Д Ѕ ↁ F Б Н Ј Ќ L Z Ж Ҁ V Б И М 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font14: String = """
ợ ฬ є г Շ ץ ย เ ๏ ק ค ร ๔ Ŧ ﻮ ђ ן к ɭ չ א ς ש ๒ ภ ๓ ợ ฬ є г Շ ץ ย เ ๏ ק ค ร ๔ Ŧ ﻮ ђ ן к ɭ չ א ς ש ๒ ภ ๓ 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font15: String = """
ዒ ሠ ቿ ዪ ፕ ሃ ሁ ጎ ዐ የ ል ነ ዕ ቻ ኗ ዘ ጋ ጕ ረ ጊ ሸ ር ሀ ጌ ክ ጠ ዒ ሠ ቿ ዪ ፕ ሃ ሁ ጎ ዐ የ ል ነ ዕ ቻ ኗ ዘ ጋ ጕ ረ ጊ ሸ ር ሀ ጌ ክ ጠ 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font16: String = """
q͓̽ w͓̽ e͓̽ r͓̽ t͓̽ y͓̽ u͓̽ i͓̽ o͓̽ p͓̽ a͓̽ s͓̽ d͓̽ f͓̽ g͓̽ h͓̽ j͓̽ k͓̽ l͓̽ z͓̽ x͓̽ c͓̽ v͓̽ b͓̽ n͓̽ m͓̽ Q͓̽ W͓̽ E͓̽ R͓̽ T͓̽ Y͓̽ U͓̽ I͓̽ O͓̽ P͓̽ A͓̽ S͓̽ D͓̽ F͓̽ G͓̽ H͓̽ J͓̽ K͓̽ L͓̽ Z͓̽ X͓̽ C͓̽ V͓̽ B͓̽ N͓̽ M͓̽ 1͓̽ 2͓̽ 3͓̽ 4͓̽ 5͓̽ 6͓̽ 7͓̽ 8͓̽ 9͓̽ 0͓̽ -͓̽ /͓̽ :͓̽ ;͓̽ (͓̽ )͓̽ $͓̽ &͓̽ @͓̽ “͓̽ .͓̽ ,͓̽ ?͓̽ !͓̽ ’͓̽ [͓̽ ]͓̽ {͓̽ }͓̽ #͓̽ %͓̽ ^͓̽ *͓̽ +͓̽ =͓̽ _͓̽ \\͓̽ |͓̽ ~͓̽ <͓̽ >͓̽ €͓̽ £͓̽ ¥͓̽ •͓̽
"""

let font17: String = """
ⓠ ⓦ ⓔ ⓡ ⓣ ⓨ ⓤ ⓘ ⓞ ⓟ ⓐ ⓢ ⓓ ⓕ ⓖ ⓗ ⓙ ⓚ ⓛ ⓩ ⓧ ⓒ ⓥ ⓑ ⓝ ⓜ Ⓠ Ⓦ Ⓔ Ⓡ Ⓣ Ⓨ Ⓤ Ⓘ Ⓞ Ⓟ Ⓐ Ⓢ Ⓓ Ⓕ Ⓖ Ⓗ Ⓙ Ⓚ Ⓛ Ⓩ Ⓧ Ⓒ Ⓥ Ⓑ Ⓝ Ⓜ ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⓪ - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font18: String = """
q͇ w͇ e͇ r͇ t͇ y͇ u͇ i͇ o͇ p͇ a͇ s͇ d͇ f͇ g͇ h͇ j͇ k͇ l͇ z͇ x͇ c͇ v͇ b͇ n͇ m͇ Q͇ W͇ E͇ R͇ T͇ Y͇ U͇ I͇ O͇ P͇ A͇ S͇ D͇ F͇ G͇ H͇ J͇ K͇ L͇ Z͇ X͇ C͇ V͇ B͇ N͇ M͇ 1͇ 2͇ 3͇ 4͇ 5͇ 6͇ 7͇ 8͇ 9͇ 0͇ -͇ /͇ :͇ ;͇ (͇ )͇ $͇ &͇ @͇ “͇ .͇ ,͇ ?͇ !͇ ’͇ [͇ ]͇ {͇ }͇ #͇ %͇ ^͇ *͇ +͇ =͇ _͇ \\͇ |͇ ~͇ <͇ >͇ €͇ £͇ ¥͇ •͇
"""

let font19: String = """
ᑫ ᗯ E ᖇ T Y ᑌ I O ᑭ ᗩ ᔕ ᗪ ᖴ G ᕼ ᒍ K ᒪ ᘔ ᙭ ᑕ ᐯ ᗷ ᑎ ᗰ ᑫ ᗯ E ᖇ T Y ᑌ I O ᑭ ᗩ ᔕ ᗪ ᖴ G ᕼ ᒍ K ᒪ ᘔ ᙭ ᑕ ᐯ ᗷ ᑎ ᗰ 1 2 3 4 5 6 7 8 9 0 - / : ; ( ) $ & @ “ . , ? ! ’ [ ] { } # % ^ * + = _ \\ | ~ < > € £ ¥ •
"""

let font20: String = """
q̷ w̷ e̷ r̷ t̷ y̷ u̷ i̷ o̷ p̷ a̷ s̷ d̷ f̷ g̷ h̷ j̷ k̷ l̷ z̷ x̷ c̷ v̷ b̷ n̷ m̷ Q̷ W̷ E̷ R̷ T̷ Y̷ U̷ I̷ O̷ P̷ A̷ S̷ D̷ F̷ G̷ H̷ J̷ K̷ L̷ Z̷ X̷ C̷ V̷ B̷ N̷ M̷ 1̷ 2̷ 3̷ 4̷ 5̷ 6̷ 7̷ 8̷ 9̷ 0̷ -̷ /̷ :̷ ;̷ (̷ )̷ $̷ &̷ @̷ “̷ .̷ ,̷ ?̷ !̷ ’̷ [̷ ]̷ {̷ }̷ #̷ %̷ ^̷ *̷ +̷ =̷ _̷ \\̷ |̷ ~̷ <̷ >̷ €̷ £̷ ¥̷ •̷
"""

//    q̾ ̾w̾ ̾e̾ ̾r̾ ̾t̾ ̾y̾ ̾u̾ ̾i̾ ̾o̾ ̾p̾ ̾a̾ ̾s̾ ̾d̾ ̾f̾ ̾g̾ ̾h̾ ̾j̾ ̾k̾ ̾l̾ ̾z̾ ̾x̾ ̾c̾ ̾v̾ ̾b̾ ̾n̾ ̾m̾ ̾Q̾ ̾W̾ ̾E̾ ̾R̾ ̾T̾ ̾Y̾ ̾U̾ ̾I̾ ̾O̾ ̾P̾ ̾A̾ ̾S̾ ̾D̾ ̾F̾ ̾G̾ ̾H̾ ̾J̾ ̾K̾ ̾L̾ ̾Z̾ ̾X̾ ̾C̾ ̾V̾ ̾B̾ ̾N̾ ̾M̾ ̾1̾ ̾2̾ ̾3̾ ̾4̾ ̾5̾ ̾6̾ ̾7̾ ̾8̾ ̾9̾ ̾0̾ ̾-̾ ̾/̾ ̾:̾ ̾;̾ ̾(̾ ̾)̾ ̾$̾ ̾&̾ ̾@̾ ̾“̾ ̾.̾ ̾,̾ ̾?̾ ̾!̾ ̾’̾ ̾[̾ ̾]̾ ̾{̾ ̾}̾ ̾#̾ ̾%̾ ̾^̾ ̾*̾ ̾+̾ ̾=̾ ̾_̾ ̾\̾ ̾|̾ ̾~̾ ̾<̾ ̾>̾ ̾€̾ ̾£̾ ̾¥̾ ̾•̾
