Repository: hdoublin/keyboardExtension
Catalog: kExtension/Resources/*.lproj/Localizable.strings
Languages: tr

source: Enable Keyboard
tr: Klavyeyi Yükle

# Go to the Settings
source: Go to Fontz Settings
tr: Fontz Ayarlarına Git

source: Tap "Keyboards"
tr: "Klavyeler"e Dokun

source: Switch on "Fontz Keyboard"
tr: "Fontz Keyboard"u Aç

source: Fontz Keyboard is Ready!
tr: Fontz Keyboard Hazır!

source: Settings
tr: Ayarlar

source: Open Fontz Settings
tr: Fontz Ayarlarını Aç

source: Leave Feedback
tr: Bize Ulaşın

# Rate Fontz
source: Rate Fontz on the App Store
tr: App Store'da Oy Ver

source: Terms of Service
tr: Kullanım Koşulları

source: Privacy & Policy
tr: Gizlilik Sözleşmesi

source: Support - Fontz
tr: Destek - Fontz

source: Error
tr: Hata

source: Your device cannot sent email. Please check your email configuration
tr: Cihazınızda e-posta tanımlı değil

source: OK
tr: Tamam

source: Unlock all super fonts
tr: Tüm fontların kilidini aç

source: New fonts updated every months
tr: Her ay yeni fontlarla güncel kal

source: Try
tr: Dene

source: 1 month
tr: 1 ay

source: Unlock All Fonts
tr: Tüm Fontları Aç
